Repository: azharriaz/authapp
Catalog: src/apps/Resources/Validators/ValidationMessages.*.resx
Languages: hi_in

# user.id.required
source: User ID is required
hi_in: उपयोगकर्ता आईडी आवश्यक है

# user.id.maxlength
source: User ID must not exceed {0} characters
hi_in: उपयोगकर्ता आईडी {0} अक्षरों से अधिक नहीं होनी चाहिए

# username.required
source: Username is required
hi_in: उपयोगकर्ता नाम आवश्यक है

# firstname.required
source: FirstName is required
hi_in: उपयोगकर्ता नाम आवश्यक है

# lastname.required
source: LastName is required
hi_in: उपयोगकर्ता नाम आवश्यक है

# username.minlength
source: Username must be at least {0} characters long
hi_in: उपयोगकर्ता नाम कम से कम {0} अक्षरों का होना चाहिए

# username.maxlength
source: Username must not exceed {0} characters
hi_in: उपयोगकर्ता नाम {0} अक्षरों से अधिक नहीं हो सकता

# username.invalid_chars
source: Username contains invalid characters
hi_in: उपयोगकर्ता नाम में अमान्य अक्षर हैं

# username.unsafe
source: Username contains unsafe characters
hi_in: उपयोगकर्ता नाम में असुरक्षित अक्षर हैं

# email.required
source: Email is required
hi_in: ईमेल आवश्यक है

# email.invalid
source: Invalid email format
hi_in: ईमेल प्रारूप अमान्य है

# roles.required
source: Roles are required
hi_in: भूमिकाएँ आवश्यक हैं

# password.required
source: Password is required
hi_in: पासवर्ड आवश्यक है

# password.minlength
source: Password must be at least {0} characters long
hi_in: पासवर्ड कम से कम {0} अक्षरों का होना चाहिए

# password.maxlength
source: Password must not exceed {0} characters
hi_in: पासवर्ड {0} अक्षरों से अधिक नहीं हो सकता

# password.uppercase
source: Password must contain at least one uppercase letter
hi_in: पासवर्ड में कम से कम एक बड़ा अक्षर होना चाहिए

# password.lowercase
source: Password must contain at least one lowercase letter
hi_in: पासवर्ड में कम से कम एक छोटा अक्षर होना चाहिए

# password.digit
source: Password must contain at least one digit
hi_in: पासवर्ड में कम से कम एक अंक होना चाहिए

# password.unsafe
source: Password contains unsafe characters
hi_in: पासवर्ड में असुरक्षित अक्षर हैं

# role.id.required
source: Role ID is required
hi_in: भूमिका आईडी आवश्यक है

# role.name.required
source: Role name is required
hi_in: भूमिका नाम आवश्यक है

# role.name.maxlength
source: Role name must not exceed {0} characters
hi_in: भूमिका नाम {0} अक्षरों से अधिक नहीं हो सकता

# role.description.maxlength
source: Role description must not exceed {0} characters
hi_in: भूमिका विवरण {0} अक्षरों से अधिक नहीं हो सकता

# validation.generic_error
source: A validation error occurred
hi_in: एक सत्यापन त्रुटि हुई

# validation.sql_injection
source: Input contains potentially unsafe characters
hi_in: इनपुट में संभावित असुरक्षित अक्षर शामिल हैं
